content/post/nfs-over-rdma/logs/rdma_fio_bs8k_iodepth32.log
task1: (g=0): rw=randread, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=32
fio-3.33
Starting 1 process

task1: (groupid=0, jobs=1): err= 0: pid=13184: Sat Jul 20 22:15:04 2024
  read: IOPS=179k, BW=1402MiB/s (1470MB/s)(41.1GiB/30001msec)
    slat (nsec): min=1248, max=71713, avg=2270.22, stdev=458.17
    clat (usec): min=77, max=18895, avg=175.68, stdev=38.29
     lat (usec): min=79, max=18898, avg=177.95, stdev=38.29
    clat percentiles (usec):
     |  1.00th=[  155],  5.00th=[  161], 10.00th=[  165], 20.00th=[  167],
     | 30.00th=[  169], 40.00th=[  172], 50.00th=[  174], 60.00th=[  176],
     | 70.00th=[  178], 80.00th=[  182], 90.00th=[  186], 95.00th=[  190],
     | 99.00th=[  210], 99.50th=[  255], 99.90th=[  619], 99.95th=[  693],
     | 99.99th=[  840]
   bw (  MiB/s): min= 1357, max= 1453, per=100.00%, avg=1403.13, stdev=24.20, samples=59
   iops        : min=173704, max=186100, avg=179601.22, stdev=3097.87, samples=59
  lat (usec)   : 100=0.01%, 250=99.47%, 500=0.33%, 750=0.16%, 1000=0.03%
  lat (msec)   : 2=0.01%, 4=0.01%, 10=0.01%, 20=0.01%
  cpu          : usr=14.57%, sys=55.09%, ctx=3255860, majf=0, minf=75
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=100.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.1%, 64=0.0%, >=64=0.0%
     issued rwts: total=5384773,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=32

Run status group 0 (all jobs):
   READ: bw=1402MiB/s (1470MB/s), 1402MiB/s-1402MiB/s (1470MB/s-1470MB/s), io=41.1GiB (44.1GB), run=30001-30001msec