content/post/nfs-over-rdma/logs/rdma_fio_bs8k_iodepth64.log
task1: (g=0): rw=randread, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=64
fio-3.33
Starting 1 process

task1: (groupid=0, jobs=1): err= 0: pid=13227: Sat Jul 20 22:15:34 2024
  read: IOPS=180k, BW=1403MiB/s (1471MB/s)(41.1GiB/30001msec)
    slat (nsec): min=1217, max=127492, avg=2125.26, stdev=418.77
    clat (usec): min=212, max=18696, avg=353.95, stdev=119.46
     lat (usec): min=214, max=18698, avg=356.08, stdev=119.46
    clat percentiles (usec):
     |  1.00th=[  322],  5.00th=[  330], 10.00th=[  334], 20.00th=[  343],
     | 30.00th=[  343], 40.00th=[  347], 50.00th=[  351], 60.00th=[  355],
     | 70.00th=[  355], 80.00th=[  359], 90.00th=[  367], 95.00th=[  371],
     | 99.00th=[  429], 99.50th=[  594], 99.90th=[  906], 99.95th=[ 1012],
     | 99.99th=[ 3851]
   bw (  MiB/s): min= 1313, max= 1457, per=100.00%, avg=1403.42, stdev=27.60, samples=59
   iops        : min=168068, max=186524, avg=179638.14, stdev=3532.98, samples=59
  lat (usec)   : 250=0.01%, 500=99.32%, 750=0.42%, 1000=0.20%
  lat (msec)   : 2=0.03%, 4=0.01%, 10=0.01%, 20=0.01%
  cpu          : usr=12.13%, sys=53.93%, ctx=3541100, majf=0, minf=138
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=0.1%, 32=0.1%, >=64=100.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.1%, >=64=0.0%
     issued rwts: total=5388021,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=64

Run status group 0 (all jobs):
   READ: bw=1403MiB/s (1471MB/s), 1403MiB/s-1403MiB/s (1471MB/s-1471MB/s), io=41.1GiB (44.1GB), run=30001-30001msec