content/post/nfs-over-rdma/logs/rdma_fio_bs8k_iodepth8.log
task1: (g=0): rw=randread, bs=(R) 8192B-8192B, (W) 8192B-8192B, (T) 8192B-8192B, ioengine=libaio, iodepth=8
fio-3.33
Starting 1 process

task1: (groupid=0, jobs=1): err= 0: pid=13012: Sat Jul 20 22:13:01 2024
  read: IOPS=124k, BW=966MiB/s (1013MB/s)(28.3GiB/30001msec)
    slat (nsec): min=1185, max=77475, avg=2149.19, stdev=356.87
    clat (usec): min=17, max=2811, avg=62.25, stdev=11.03
     lat (usec): min=42, max=2813, avg=64.40, stdev=11.02
    clat percentiles (usec):
     |  1.00th=[   50],  5.00th=[   53], 10.00th=[   55], 20.00th=[   57],
     | 30.00th=[   59], 40.00th=[   61], 50.00th=[   62], 60.00th=[   64],
     | 70.00th=[   65], 80.00th=[   68], 90.00th=[   70], 95.00th=[   72],
     | 99.00th=[   81], 99.50th=[   99], 99.90th=[  163], 99.95th=[  273],
     | 99.99th=[  437]
   bw (  KiB/s): min=964544, max=1002288, per=100.00%, avg=988858.58, stdev=7985.96, samples=59
   iops        : min=120568, max=125286, avg=123607.32, stdev=998.25, samples=59
  lat (usec)   : 20=0.01%, 50=1.60%, 100=97.91%, 250=0.43%, 500=0.05%
  lat (usec)   : 750=0.01%, 1000=0.01%
  lat (msec)   : 2=0.01%, 4=0.01%
  cpu          : usr=10.40%, sys=38.60%, ctx=2939516, majf=0, minf=27
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=100.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.1%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=3708386,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=8

Run status group 0 (all jobs):
   READ: bw=966MiB/s (1013MB/s), 966MiB/s-966MiB/s (1013MB/s-1013MB/s), io=28.3GiB (30.4GB), run=30001-30001msec