content/post/nfs-over-rdma/logs/tcp_fio_bs1024k_iodepth1.log
task1: (g=0): rw=randread, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=1
fio-3.33
Starting 1 process

task1: (groupid=0, jobs=1): err= 0: pid=16552: Sat Jul 20 23:01:55 2024
  read: IOPS=1690, BW=1690MiB/s (1772MB/s)(49.5GiB/30001msec)
    slat (usec): min=35, max=802, avg=46.14, stdev= 7.95
    clat (usec): min=474, max=2285, avg=544.48, stdev=43.32
     lat (usec): min=513, max=3088, avg=590.62, stdev=48.94
    clat percentiles (usec):
     |  1.00th=[  486],  5.00th=[  498], 10.00th=[  510], 20.00th=[  523],
     | 30.00th=[  529], 40.00th=[  537], 50.00th=[  545], 60.00th=[  545],
     | 70.00th=[  553], 80.00th=[  553], 90.00th=[  570], 95.00th=[  603],
     | 99.00th=[  676], 99.50th=[  701], 99.90th=[ 1237], 99.95th=[ 1270],
     | 99.99th=[ 1352]
   bw (  MiB/s): min= 1376, max= 1762, per=100.00%, avg=1690.78, stdev=51.10, samples=59
   iops        : min= 1376, max= 1762, avg=1690.78, stdev=51.10, samples=59
  lat (usec)   : 500=6.05%, 750=93.74%, 1000=0.05%
  lat (msec)   : 2=0.16%, 4=0.01%
  cpu          : usr=0.37%, sys=8.28%, ctx=50713, majf=0, minf=264
  IO depths    : 1=100.0%, 2=0.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=50709,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=1

Run status group 0 (all jobs):
   READ: bw=1690MiB/s (1772MB/s), 1690MiB/s-1690MiB/s (1772MB/s-1772MB/s), io=49.5GiB (53.2GB), run=30001-30001msec