content/post/nfs-over-rdma/logs/tcp_fio_bs1024k_iodepth3.log
task1: (g=0): rw=randread, bs=(R) 1024KiB-1024KiB, (W) 1024KiB-1024KiB, (T) 1024KiB-1024KiB, ioengine=libaio, iodepth=3
fio-3.33
Starting 1 process

task1: (groupid=0, jobs=1): err= 0: pid=16640: Sat Jul 20 23:02:56 2024
  read: IOPS=2621, BW=2621MiB/s (2748MB/s)(76.8GiB/30001msec)
    slat (usec): min=30, max=983, avg=36.51, stdev= 6.79
    clat (usec): min=637, max=2812, avg=1107.54, stdev=126.70
     lat (usec): min=670, max=3449, avg=1144.06, stdev=126.89
    clat percentiles (usec):
     |  1.00th=[  955],  5.00th=[ 1004], 10.00th=[ 1012], 20.00th=[ 1020],
     | 30.00th=[ 1029], 40.00th=[ 1037], 50.00th=[ 1057], 60.00th=[ 1106],
     | 70.00th=[ 1139], 80.00th=[ 1172], 90.00th=[ 1254], 95.00th=[ 1369],
     | 99.00th=[ 1614], 99.50th=[ 1663], 99.90th=[ 1762], 99.95th=[ 1844],
     | 99.99th=[ 2180]
   bw (  MiB/s): min= 2450, max= 2748, per=99.98%, avg=2620.61, stdev=50.29, samples=59
   iops        : min= 2450, max= 2748, avg=2620.61, stdev=50.29, samples=59
  lat (usec)   : 750=0.01%, 1000=4.54%
  lat (msec)   : 2=95.43%, 4=0.02%
  cpu          : usr=0.25%, sys=10.00%, ctx=78639, majf=0, minf=267
  IO depths    : 1=0.1%, 2=100.0%, 4=0.0%, 8=0.0%, 16=0.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwts: total=78635,0,0,0 short=0,0,0,0 dropped=0,0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=3

Run status group 0 (all jobs):
   READ: bw=2621MiB/s (2748MB/s), 2621MiB/s-2621MiB/s (2748MB/s-2748MB/s), io=76.8GiB (82.5GB), run=30001-30001msec